Revit 2017 API
StructuralSectionCProfileWithFold Class
 Defines parameters for C Profile with fold structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionCProfileWithFold : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionCProfileWithFold _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionCProfileWithFold : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold
See Also
StructuralSectionCProfileWithFold Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace